Repository: 1595901624/flux
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ar, de, es, fa, id, ja, ko, ru, tr, tt, zh_cn, zh_tw

# Proxy_StaleRestored.Text
source: Detected unrestored system proxy from last session; original settings restored
es: Detectado proxy sin restaurar; se restauró la configuración original
ru: Обнаружен не восстановленный прокси; настройки восстановлены

# Proxy_LegacyDisabled.Text
source: Detected stale proxy from an older version; disabled automatically
es: Proxy de versión anterior detectado; desactivado
ru: Обнаружен прокси от старой версии; отключён

# Proxy_StaleRestoreFailed.Text
source: Failed to restore stale proxy: {0}
es: Error al restaurar proxy residual: {0}
ru: Не удалось восстановить остаточный прокси: {0}

# Proxy_ChangedByOther.Text
source: System proxy was changed by another program; Flux will not overwrite it
es: El proxy fue modificado por otro programa; Flux no lo sobrescribirá
ru: Системный прокси изменён другой программой; Flux не перезапишет

# Proxy_SnapshotReadFailed.Text
source: Failed to read proxy snapshot: {0}
es: Error al leer la instantánea del proxy: {0}
ru: Ошибка чтения снимка прокси: {0}

# Proxy_ChangedRestoring.Text
source: System proxy changed externally; restoring
es: Cambio externo del proxy detectado; restaurando
ru: Обнаружено внешнее изменение прокси; восстановление

# Proxy_GuardError.Text
source: Proxy guard error: {0}
es: Error del guardián del proxy: {0}
ru: Ошибка защиты прокси: {0}

# Config_VergeLoadFailed.Text
source: Failed to load verge.yaml: {0}
es: Error al cargar verge.yaml: {0}
ru: Ошибка загрузки verge.yaml: {0}

# Config_VergeMigrateBackupFailed.Text
source: verge.yaml migration backup failed: {0}
es: Error de respaldo de migración de verge.yaml: {0}
ru: Ошибка резервной копии миграции verge.yaml: {0}

# Config_VergeMigrated.Text
source: verge.yaml migrated to schema v{0}; backup: {1}
es: verge.yaml migrado a esquema v{0}; copia: {1}
ru: verge.yaml мигрирован на схему v{0}; копия: {1}

# Config_ClashLoadFailed.Text
source: Failed to load config.yaml: {0}
es: Error al cargar config.yaml: {0}
ru: Ошибка загрузки config.yaml: {0}

# Config_ProfilesLoadFailed.Text
source: Failed to load profiles.yaml: {0}
es: Error al cargar profiles.yaml: {0}
ru: Ошибка загрузки profiles.yaml: {0}

# DeepLink_RegisterFailed.Text
source: Protocol registration failed: {0}
es: Error al registrar el protocolo: {0}
ru: Ошибка регистрации протокола: {0}

# DeepLink_ImportFailed.Text
source: Deep-link import failed: {0}
es: Error al importar enlace: {0}
ru: Ошибка импорта по глубокой ссылке: {0}

# AutoStart_DisabledByUser.Text
source: Auto launch was disabled by the user; re-enable Flux Proxy in Task Manager's Startup apps
es: El inicio automático fue deshabilitado por el usuario; rehabilítelo en el Administrador de tareas
ru: Автозапуск отключён пользователем; включите в диспетчере задач

# AutoStart_DisabledByPolicy.Text
source: Auto launch is disabled by system policy
es: El inicio automático está deshabilitado por directiva
ru: Автозапуск отключён системной политикой

# AutoStart_NotAllowed.Text
source: The user did not allow auto launch
es: El usuario no permitió el inicio automático
ru: Пользователь не разрешил автозапуск

# AutoStart_RunKeyFailed.Text
source: Could not open the Run registry key
es: No se pudo abrir la clave del Registro Run
ru: Не удалось открыть раздел реестра Run

# Boot_LanguageFailed.Text
source: Failed to set language: {0}
es: Error al establecer idioma: {0}
ru: Ошибка установки языка: {0}

# Boot_SkipProxyNoCore.Text
source: Core not ready; skipped system proxy to avoid network outage
es: Núcleo no listo; se omitió el proxy del sistema
ru: Ядро не готово; системный прокси пропущен

# Boot_HotkeyInitFailed.Text
source: Hotkey init failed: {0}
es: Error al inicializar atajos: {0}
ru: Ошибка инициализации горячих клавиш: {0}

# Boot_HotkeyRegisterFailed.Text
source: Hotkey registration failed: {0}
es: Error al registrar atajo: {0}
ru: Ошибка регистрации горячей клавиши: {0}

# Boot_HotkeyExecFailed.Text
source: Hotkey execution failed ({0}): {1}
es: Error al ejecutar atajo ({0}): {1}
ru: Ошибка выполнения горячей клавиши ({0}): {1}

# Boot_HotkeyNotImplemented.Text
source: Hotkey action not implemented: {0}
es: Acción de atajo no implementada: {0}
ru: Действие горячей клавиши не реализовано: {0}

# Boot_TunDisabledNoPrivilege.Text
source: No admin rights and service unavailable; TUN safely disabled
es: Sin permisos de admin y servicio no disponible; TUN desactivado
ru: Нет прав админа и службы; TUN безопасно отключён

# Boot_LightweightAuto.Text
source: Window closed for {0} minutes; entering lightweight mode
es: Ventana cerrada {0} minutos; entrando en modo ligero
ru: Окно закрыто {0} мин; переход в облегчённый режим

# Boot_LightweightAutoFailed.Text
source: Auto lightweight failed: {0}
es: Error en modo ligero automático: {0}
ru: Ошибка авто-облегчённого режима: {0}

# Lightweight_Entered.Text
source: Entered lightweight mode (main window released; core keeps running)
es: Modo ligero activado (ventana liberada; el núcleo sigue)
ru: Включён облегчённый режим (окно освобождено, ядро работает)

# Lightweight_Exited.Text
source: Exited lightweight mode
es: Salió del modo ligero
ru: Вышел из облегчённого режима

# Boot_StartFailed.Text
source: Start failed: {0}
es: Error al iniciar: {0}
ru: Ошибка запуска: {0}

# Boot_CoreStartFailed.Text
source: Core start failed: {0}
es: Error al iniciar el núcleo: {0}
ru: Ошибка запуска ядра: {0}

# Boot_SysProxyApplyFailed.Text
source: Failed to apply system proxy: {0}
es: Error al aplicar proxy del sistema: {0}
ru: Ошибка применения системного прокси: {0}

# Home_ToggleSysProxy.Header
source: System proxy
es: Proxy del sistema
ru: Системный прокси

# Home_ToggleTun.Header
source: TUN mode
es: Modo TUN
ru: Режим TUN

# Home_MixedPortLabel.Text
source: Mixed port:
es: Puerto mixto:
ru: Смешанный порт:

# Home_UptimeLabel.Text
source: Uptime:
es: Tiempo activo:
ru: Время работы:

# Home_RulesCountLabel.Text
source: Rules:
es: Reglas:
ru: Правил:

# Home_RestartCore.Text
source: Restart core
es: Reiniciar núcleo
ru: Перезапустить ядро

# Home_OpenLogs.Text
source: Open log folder
es: Abrir carpeta de logs
ru: Открыть папку логов

# Profiles_CurrentBadge.Text
source: Current
es: Actual
ru: Текущая

# Profiles_TipUpdate.ToolTipService.ToolTip
source: Update profile
es: Actualizar perfil
ru: Обновить подписку

# Profiles_TipDelete.ToolTipService.ToolTip
source: Delete profile
es: Eliminar perfil
ru: Удалить подписку

# Proxies_TipGroupTest.ToolTipService.ToolTip
source: Test group latency
es: Probar latencia del grupo
ru: Тест задержки группы

# ProfileEdit_NamePlaceholder.Text
source: Profile name
es: Nombre del perfil
ru: Имя подписки

# ProfileEdit_DescPlaceholder.Text
source: Description (optional)
es: Descripción (opcional)
ru: Описание (необяз.)

# ProfileEdit_UaPlaceholder.Text
source: Default clash-verge/v2.5.2
es: Predeterminado clash-verge/v2.5.2
ru: По умолчанию clash-verge/v2.5.2

# ProfileEdit_InvalidCertLabel.Text
source: Accept invalid TLS certificates (dangerous)
es: Aceptar certificados TLS no válidos (peligroso)
ru: Принимать недействительные TLS-сертификаты (опасно)

# ProfileEdit_AutoUpdateLabel.Text
source: Include in auto update
es: Incluir en actualización automática
ru: Участвовать в автообновлении

# ProfileEdit_ChannelAuto.Text
source: Auto fallback (direct → core → system)
es: Retroceso automático (directo→núcleo→sistema)
ru: Авто-откат (напрямую→ядро→система)

# ProfileEdit_ChannelCore.Text
source: Via core proxy
es: Vía proxy del núcleo
ru: Через прокси ядра

# ProfileEdit_ChannelSystem.Text
source: Via system proxy
es: Vía proxy del sistema
ru: Через системный прокси

# ProfileEdit_FieldName.Text
source: Name
es: Nombre
ru: Имя

# ProfileEdit_FieldDesc.Text
source: Description
es: Descripción
ru: Описание

# ProfileEdit_FieldUrl.Text
source: Subscription URL
es: URL de suscripción
ru: URL подписки

# ProfileEdit_FieldChannel.Text
source: Update channel
es: Canal de actualización
ru: Канал обновления

# ProfileEdit_FieldInterval.Text
source: Update interval (minutes, 0 = off)
es: Intervalo (minutos, 0 = manual)
ru: Интервал (мин, 0 = выкл.)

# ProfileEdit_FieldTimeout.Text
source: Download timeout (seconds)
es: Tiempo de espera (segundos)
ru: Таймаут загрузки (сек)

# Enhace_SaveAndApply.Text
source: Save & apply
es: Guardar y aplicar
ru: Сохранить и применить

# Enhance_NameGlobalMerge.Text
source: Global Merge
es: Merge global
ru: Глобальный Merge

# Enhance_NameGlobalScript.Text
source: Global Script
es: Script global
ru: Глобальный Script

# Enhance_NameProfileMerge.Text
source: Profile Merge
es: Merge de perfil
ru: Merge профиля

# Enhance_NameProfileScript.Text
source: Profile Script
es: Script de perfil
ru: Script профиля

# Enhance_NameProfileRules.Text
source: Profile Rules
es: Rules de perfil
ru: Правила профиля

# Enhance_NameProfileProxies.Text
source: Profile Proxies
es: Proxies de perfil
ru: Прокси профиля

# Enhance_NameProfileGroups.Text
source: Profile Groups
es: Groups de perfil
ru: Группы профиля

# Enhance_TypedName.Text
source: {0} enhancement
es: Mejora de {0}
ru: Улучшение {0}

# Enhance_ScriptNeedsMain.Text
source: Script must define main(config, profileName)
es: El script debe definir main(config, profileName)
ru: Скрипт должен определять main(config, profileName)

# Validator_InvalidYamlMapping.Text
source: Content is not a valid YAML mapping
es: El contenido no es un mapeo YAML válido
ru: Содержимое не является корректным YAML-отображением

# Validator_InvalidYaml.Text
source: Content is not valid YAML
es: El contenido no es YAML válido
ru: Содержимое не является корректным YAML

# Validator_NotClash.Text
source: Missing proxies / proxy-providers; not a valid Clash config
es: Faltan proxies/proxy-providers
ru: Отсутствуют proxies/proxy-providers

# Enhance_GlobalNotSupported.Text
source: This type has no global enhancement
es: Este tipo no admite mejora global
ru: Глобальное улучшение для этого типа недоступно

# Yaml_ParseFailed.Text
source: YAML parse failed: {0}
es: Error al analizar YAML: {0}
ru: Ошибка разбора YAML: {0}

# Format_Timeout.Text
source: Timeout
es: Tiempo agotado
ru: Таймаут

# Paths_CoreMissing.Text
source: Bundled mihomo core not found (core\mihomo.exe)
es: No se encontró el núcleo mihomo
ru: Встроенное ядро mihomo не найдено

# Proxies_CurrentNow.Text
source: Now: {0}
es: Actual: {0}
ru: Сейчас: {0}

# Proxies_NodeCount.Text
source: {0} nodes
es: {0} nodos
ru: {0} узлов

# ProxiesVM_ModeSwitchFailed.Text
source: Mode switch failed: {0}
es: Error al cambiar de modo: {0}
ru: Ошибка смены режима: {0}

# ProxiesVM_ClosedOldConnections.Text
source: Closed {0} old connections after switching
es: {0} conexiones antiguas cerradas
ru: После переключения закрыто {0} соединений

# ProxiesVM_NodeSwitchFailed.Text
source: Node switch failed [{0} → {1}]: {2}
es: Error al cambiar nodo [{0} → {1}]: {2}
ru: Ошибка смены узла [{0} → {1}]: {2}

# RulesVM_LoadFailed.Text
source: Load failed: {0}
es: Error al cargar: {0}
ru: Ошибка загрузки: {0}

# RulesVM_Count.Text
source: {0} rules total
es: {0} reglas
ru: Всего {0} правил

# Logs_Continue.Text
source: Resume
es: Continuar
ru: Продолжить

# Hotkey_UnknownCombo.Text
source: {0}: unrecognized combo "{1}"
es: {0}: combinación no reconocida "{1}"
ru: {0}: неизвестная комбинация "{1}"

# Hotkey_Duplicate.Text
source: {0}: conflicts with "{1}" ({2})
es: {0}: conflicto con "{1}" ({2})
ru: {0}: конфликт с "{1}" ({2})

# Hotkey_InUse.Text
source: {0}: combo "{1}" is already in use
es: {0}: la combinación "{1}" ya está en uso
ru: {0}: комбинация "{1}" уже занята

# Priv_ActionStartCore.Text
source: Start core via service
es: Iniciar núcleo vía servicio
ru: Запуск ядра через службу

# Priv_ActionStopCore.Text
source: Stop core via service
es: Detener núcleo vía servicio
ru: Остановка ядра через службу

# Priv_ServiceUnavailable.Text
source: Cannot connect to the Flux service
es: No se puede conectar al servicio Flux
ru: Не удалось подключиться к службе Flux

# Priv_VersionMismatch.Text
source: Service protocol version mismatch (service v{0}, app v{1}); restart the service
es: Versión de protocolo incompatible (servicio v{0}, app v{1}); reinicie el servicio
ru: Несовпадение версии протокола (служба v{0}, приложение v{1}); перезапустите службу

# Priv_UnknownError.Text
source: Unknown service error
es: Error desconocido del servicio
ru: Неизвестная ошибка службы

# Priv_InstallerMissing.Text
source: Service installer not found; reinstall the app
es: Instalador del servicio no encontrado; reinstale la app
ru: Установщик службы не найден; переустановите приложение

# Priv_InstallerLaunchFailed.Text
source: Failed to launch installer
es: No se pudo iniciar el instalador
ru: Не удалось запустить установщик

# Priv_InstallerExitCode.Text
source: Installer exit code {0} (cancelled or failed)
es: Código de salida del instalador {0} (cancelado o fallido)
ru: Код выхода установщика {0} (отмена или сбой)

# Priv_NotReady.Text
source: Service installed but not ready
es: Servicio instalado pero no listo
ru: Служба установлена, но не готова

# Priv_InstallStep.Text
source: Service install
es: Instalación del servicio
ru: Установка службы

# WinInet_NotifyFailed.Text
source: Failed to notify Windows of the proxy change
es: No se pudo notificar a Windows
ru: Не удалось уведомить Windows

# WinInet_RefreshFailed.Text
source: Failed to refresh Windows proxy settings
es: No se pudo actualizar el proxy de Windows
ru: Не удалось обновить настройки прокси

# WinInet_ReadFailed.Text
source: Failed to read Windows proxy settings
es: No se pudo leer el proxy de Windows
ru: Не удалось прочитать настройки прокси

# WinInet_WriteFailed.Text
source: Failed to modify Windows proxy settings
es: No se pudo modificar el proxy de Windows
ru: Не удалось изменить настройки прокси

# App_UnhandledUi.Text
source: UI unhandled exception: {0}
es: Excepción no controlada de UI: {0}
ru: Необработанное исключение UI: {0}

# App_UnhandledDomain.Text
source: Process unhandled exception: {0}
es: Excepción no controlada del proceso: {0}
ru: Необработанное исключение процесса: {0}

# App_UnobservedTask.Text
source: Unobserved task exception: {0}
es: Excepción de tarea no observada: {0}
ru: Необработанное исключение задачи: {0}

# Settings_AppDescription.Text
source: Clash/Mihomo client built on WinUI 3 · v{0}
es: Cliente Clash/Mihomo basado en WinUI 3 · v{0}
ru: Клиент Clash/Mihomo на WinUI 3 · v{0}

# Settings_Unknown.Text
source: Unknown
es: Desconocido
ru: Неизвестно

# Settings_AutoStartReadFailed.Text
source: Failed to read auto-launch state: {0}
es: Error al leer estado de autoinicio: {0}
ru: Ошибка чтения состояния автозапуска: {0}

# Settings_AutoStartFailed.Text
source: Failed to set auto launch: {0}
es: Error al configurar autoinicio: {0}
ru: Ошибка настройки автозапуска: {0}

# Settings_AutoStartUpdateFailed.Text
source: Failed to update auto launch: {0}
es: Error al actualizar autoinicio: {0}
ru: Ошибка обновления автозапуска: {0}

# Settings_SysProxyFailed.Text
source: Failed to set system proxy: {0}
es: Error al configurar proxy del sistema: {0}
ru: Ошибка настройки системного прокси: {0}

# Settings_PacFailed.Text
source: Failed to set PAC mode: {0}
es: Error al configurar modo PAC: {0}
ru: Ошибка настройки режима PAC: {0}

# Settings_GuardFailed.Text
source: Failed to set proxy guard: {0}
es: Error al configurar guardián: {0}
ru: Ошибка настройки защиты прокси: {0}

# Settings_BypassFailed.Text
source: Failed to set bypass list: {0}
es: Error al configurar exclusión: {0}
ru: Ошибка настройки списка исключений: {0}

# Diag_Title.Text
source: === Flux Diagnostics ===
es: === Diagnóstico de Flux ===
ru: === Диагностика Flux ===

# Diag_ExportedAt.Text
source: Exported at: {0}
es: Exportado: {0}
ru: Время экспорта: {0}

# Diag_SectionSystem.Text
source: --- System ---
es: --- Sistema ---
ru: --- Система ---

# Diag_OsVersion.Text
source: OS version: {0}
es: Versión del SO: {0}
ru: Версия ОС: {0}

# Diag_Arch.Text
source: Architecture: {0}
es: Arquitectura: {0}
ru: Архитектура: {0}

# Diag_Processors.Text
source: Processors: {0}
es: Procesadores: {0}
ru: Процессоров: {0}

# Diag_FluxVersion.Text
source: Flux version: {0}
es: Versión de Flux: {0}
ru: Версия Flux: {0}

# Diag_RunMode.Text
source: Run mode: {0}
es: Modo de ejecución: {0}
ru: Режим запуска: {0}

# Diag_Admin.Text
source: Administrator: {0}
es: Administrador: {0}
ru: Администратор: {0}

# Diag_SectionCore.Text
source: --- Core ---
es: --- Núcleo ---
ru: --- Ядро ---

# Diag_CoreVersion.Text
source: mihomo version: {0}
es: Versión de mihomo: {0}
ru: Версия mihomo: {0}

# Diag_CoreVersionFailed.Text
source: mihomo version: failed to get ({0})
es: Versión de mihomo: error al obtener ({0})
ru: Версия mihomo: ошибка получения ({0})

# Diag_CoreMode.Text
source: Core mode: {0}
es: Modo del núcleo: {0}
ru: Режим ядра: {0}

# Diag_ServiceState.Text
source: Service state: {0}
es: Estado del servicio: {0}
ru: Состояние службы: {0}

# Diag_SectionConfig.Text
source: --- Config structure (sensitive fields masked) ---
es: --- Estructura de configuración (campos sensibles ocultos) ---
ru: --- Структура конфигурации (скрыто) ---

# Diag_CurrentProfile.Text
source: Current profile: {0}
es: Perfil actual: {0}
ru: Текущая подписка: {0}

# Diag_SectionRuntime.Text
source: --- Runtime settings summary ---
es: --- Resumen de ajustes de ejecución ---
ru: --- Сводка настроек ---

# Diag_SystemProxyLine.Text
source: System proxy: {0} (PAC: {1})
es: Proxy del sistema: {0} (PAC: {1})
ru: Системный прокси: {0} (PAC: {1})

# Diag_SectionLogs.Text
source: --- Recent app logs (200, masked) ---
es: --- Registros recientes (200, ocultos) ---
ru: --- Последние журналы (200, скрыто) ---

# Diag_NoLogFile.Text
source: (no app log file)
es: (sin archivo de log)
ru: (нет файла журнала)

# Diag_LogReadFailed.Text
source: (failed to read logs: {0})
es: (error al leer logs: {0})
ru: (ошибка чтения журналов: {0})

# Diag_Exported.Text
source: Diagnostics exported: {0}
es: Diagnóstico exportado: {0}
ru: Диагностика экспортирована: {0}

# Diag_MaskedValue.Text
source: (masked)
es: (oculto)
ru: (скрыто)

# Enhance_YamlSyntaxError.Text
source: YAML syntax error in {0} (must be a key-value mapping)
es: Error de sintaxis YAML en {0} (debe ser un mapeo)
ru: Синтаксическая ошибка YAML в {0} (нужен mapping)

# Boot_HotkeyModeSwitch.Text
source: Hotkey switched mode: {0}
es: Atajo cambió modo: {0}
ru: Горячая клавиша сменила режим: {0}

# Settings_LangFollowSystem.Content
source: Follow system
es: Según el sistema
ru: Как в системе

# App_ShutdownFailed.Text
source: Shutdown cleanup failed: {0}
es: Error al limpiar al salir: {0}
ru: Ошибка очистки при выходе: {0}

# Config_RuntimeGenFailed.Text
source: Runtime config generation failed
es: Error al generar configuración
ru: Ошибка генерации конфигурации

# Config_TargetDirMissing.Text
source: Target file has no directory
es: El archivo de destino no tiene directorio
ru: У целевого файла нет каталога

# Core_Pid.Text
source: mihomo PID: {0}
es: PID de mihomo: {0}
